# **데이터프레임 결합**

## **1.환경준비**

* 라이브러리 불러오기

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

* 데이터 가져오기

In [2]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")

sales1 = sales.loc[sales['Store_ID']==1]
sales2 = sales.loc[sales['Store_ID']==2]
sales5 = sales.loc[sales['Store_ID']==5]
sales11 = sales.loc[sales['Store_ID']==11]

products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")

In [3]:
sales1.head()

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7
3         8  2013-01-01         1  0.0           8
4        10  2013-01-01         1  0.0          10

In [4]:
products.head()

   Product_ID Product_Code      SubCategory         Category  LeadTime  Price
0          20        HG001  Gardening Tools  Household Goods         2     50
1          27        HH001  Home Appliances  Household Goods         2    150
2          16        HK001          Kitchen  Household Goods         2     23
3          15        HK002          Kitchen  Household Goods         2     41
4          32        GS001          Seafood          Grocery         3     34

In [57]:
stores.head(30)

    Store_ID           City           State  Store_Type
0          1     Saint Paul       Minnesota           4
1          2     Saint Paul       Minnesota           4
2          3     Saint Paul       Minnesota           4
3          4     Saint Paul       Minnesota           4
4          5  Oklahoma City        Oklahoma           4
5          6     Saint Paul       Minnesota           4
6          7     Saint Paul       Minnesota           4
7          8     Saint Paul       Minnesota           4
8          9     Saint Paul       Minnesota           2
9         10     Saint Paul       Minnesota           3
10        11    Minneapolis       Minnesota           2
11        12      Annapolis        Maryland           3
12        13      Annapolis        Maryland           3
13        14     Harrisburg    Pennsylvania           3
14        15      Nashville       Tennessee           3
15        16  Oklahoma City        Oklahoma           3
16        17     Saint Paul       Minnesota           3
17        18     Saint Paul       Minnesota           2
18        19         Boston   Massachusetts           3
19        20     Saint Paul       Minnesota           2
20        21  Oklahoma City        Oklahoma           2
21        22             LA      California           3
22        23        Phoenix         Arizona           4
23        24        Raleigh  North Carolina           4
24        25        Olympia      Washington           4
25        26        Raleigh  North Carolina           4
26        27      Charlotte  North Carolina           4
27        28        Raleigh  North Carolina           5
28        29        Raleigh  North Carolina           5
29        30        Raleigh  North Carolina           3

## **2.결합1 : 붙이기 concat()**

* 데이터를 생성해 봅시다.

In [14]:
df1 = pd.DataFrame({'A':[10,25], 'B':[15,30]})
df2 = pd.DataFrame({'A':[20,30, 50], 'C':[35,30, 40]})
df2.drop([1], inplace = True)

display(df1)
display(df2)

    A   B
0  10  15
1  25  30

    A   C
0  20  35
2  50  40

### **(1) 세로로 합치기 : axis = 0**

* join = 'inner'

In [ ]:
pd.concat([df1, df2], axis = 0, join = 'inner')

* join = 'outer'

In [ ]:
pd.concat([df1, df2], axis = 0, join = 'outer')

### **(2) 가로로 합치기 : axis = 1**

* join = 'inner'

In [ ]:
pd.concat([df1, df2], axis = 1, join = 'inner')

* join = 'outer'

In [ ]:
pd.concat([df1, df2], axis = 1, join = 'outer')

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] sales1,2,5,11 데이터프레임을 하나로 합칩시다. 어떻게 합치는게 좋을까요?

In [16]:
pd.concat([sales1,sales2,sales5,sales11], axis=0, join='inner')

       Order_ID        Date  Store_ID      Qty  Product_ID
0             3  2013-01-01         1    0.000           3
1             5  2013-01-01         1    0.000           5
2             7  2013-01-01         1    0.000           7
3             8  2013-01-01         1    0.000           8
4            10  2013-01-01         1    0.000          10
...         ...         ...       ...      ...         ...
24340     53548  2013-01-31        11   10.000          22
24341     53550  2013-01-31        11  641.507          24
24342     53553  2013-01-31        11    0.000          27
24343     53555  2013-01-31        11   27.000          29
24344     53558  2013-01-31        11   13.000          32

[1860 rows x 5 columns]

[문2] (조금 어려운 문제!)  
일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.concat 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.concat 으로 가로로 합치기

## **3.결합 ① : 조인 join(merge)**

* 판다스에서 join은 굉장히 간단합니다.
* 자동으로 key를 잡아줍니다
* default로 inner join을 합니다.

In [96]:
df1 = pd.DataFrame({'A':[1,2], 'B':[15,30], 'C':[20, 25]})
df2 = pd.DataFrame({'A':[2,3], 'D':[20, 35]})

display(df1)
display(df2)

   A   B   C
0  1  15  20
1  2  30  25

   A   D
0  2  20
1  3  35

### **(1) inner merge**

In [97]:
pd.merge(df1, df2, how = 'inner', on = 'A')

   A   B   C   D
0  2  30  25  20

In [27]:
pd.merge(df1, df2, how = 'inner')
# 알아서 같은 열을 기준으로 병합, 
# 같은 열이 여러 개이면 해당 열의 값들이 다 같아야함

   A   B   C   D
0  2  30  25  20

### **(2) left merge**

In [ ]:
pd.merge(df1, df2, how = 'left')

### **(3) right merge**

In [ ]:
pd.merge(df1, df2, how = 'right')

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.merge 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.merge 으로 결합하기

count             31
unique            31
top       2013-01-01
freq               1
Name: Date, dtype: object

          Date     Qty1_Sum     Qty2_Sum     Qty5_Sum     Qty11_Sum
0   2013-01-01     0.000000     0.000000     0.000000      0.000000
1   2013-01-02  6760.782000  9221.338001  9404.229020  16593.312000
2   2013-01-03  5348.384001  6830.089000  6932.685000  11032.676040
3   2013-01-04  5390.445001  6742.984000  6567.938000  10962.687002
4   2013-01-05  5787.839000  8583.055000  7276.800000  13315.896000
5   2013-01-06  2007.194000  9317.139000  9578.077030  14165.615050
6   2013-01-07  5639.396000  6047.629000  5729.203000   9946.420000
7   2013-01-08  5131.128000  5545.928020  5716.248000   9258.956000
8   2013-01-09  6198.154980  6061.471020  5352.507000   8644.922000
9   2013-01-10  4309.750000  5070.431000  5319.121020   8470.169000
10  2013-01-11  5053.745980  5822.891982  5786.585000   7316.129000
11  2013-01-12  5073.569980  7479.722000  6246.480000  10959.593000
12  2013-01-13  2482.635000  9059.072000  8299.981000  10857.623960
13  2013-01-14  5192.406000  5404.198000  5398.938000   7789.259030
14  2013-01-15  4774.043000  5255.754000  5528.819000   8215.977970
15  2013-01-16  6210.563002  6543.510000  6147.083980   7540.355000
16  2013-01-17  4544.486000  5214.799020  5109.820000   7395.201000
17  2013-01-18  5419.165001  6668.457000  5043.555000   7918.020000
18  2013-01-19  5447.259000  8016.393000  6228.933000  11044.523000
19  2013-01-20  2153.939995  8932.121020  8204.085000  11211.312000
20  2013-01-21  4784.614020  6380.861000  5511.559999   9088.764040
21  2013-01-22  4922.417000  5658.953001  5426.481000   7967.939000
22  2013-01-23  5770.343000  6056.067000  5624.662000   7246.130000
23  2013-01-24  4559.193000  4608.736000  5053.194000   7802.938000
24  2013-01-25  5144.064000  6096.080000  5591.837000   7977.591980
25  2013-01-26  4820.926000  7550.064982  6232.117000  10446.452000
26  2013-01-27  2242.990000  8169.363000  6562.350000  10590.136000
27  2013-01-28  4484.428000  5111.355000  5595.128020   8419.120000
28  2013-01-29  4285.201001  5210.258000  4720.338000   6970.078000
29  2013-01-30  5634.577000  5956.379000  5071.153000   7744.136020
30  2013-01-31  4341.563000  4862.804996  5230.479000   8367.902000

[문2] 매장1에 대해서, 일별, 카테고리별 판매량 합계를 구해 봅시다.

,Order_ID,Date,Store_ID,Qty,Product_ID,Product_Code,SubCategory,Category,LeadTime,Price
0,3,2013-01-01,1,0.0,3,DB001,Beverage,Drink,2,8
1,1785,2013-01-02,1,1091.0,3,DB001,Beverage,Drink,2,8
2,3567,2013-01-03,1,919.0,3,DB001,Beverage,Drink,2,8
3,5349,2013-01-04,1,953.0,3,DB001,Beverage,Drink,2,8
4,7131,2013-01-05,1,1160.0,3,DB001,Beverage,Drink,2,8

Date        Category
2013-01-01  Drink                 0.000
            Food                  0.000
            Grocery               0.000
            Household Goods       0.000
2013-01-02  Drink              1158.000
                                 ...
2013-01-30  Household Goods     932.000
2013-01-31  Drink               971.000
            Food                751.766
            Grocery            1907.797
            Household Goods     711.000
Name: Qty, Length: 124, dtype: float64

[문3] 도시별, 총판매량 합계를 구하시오.

,Order_ID,Date,Store_ID,Qty,Product_ID,City,State,Store_Type
0,3,2013-01-01,1,0.000,3,Saint Paul,Minnesota,4
1,5,2013-01-01,1,0.000,5,Saint Paul,Minnesota,4
2,7,2013-01-01,1,0.000,7,Saint Paul,Minnesota,4
3,8,2013-01-01,1,0.000,8,Saint Paul,Minnesota,4
4,10,2013-01-01,1,0.000,10,Saint Paul,Minnesota,4
...,...,...,...,...,...,...,...,...
25105,55231,2013-01-31,9,47.000,22,Saint Paul,Minnesota,2
25106,55233,2013-01-31,9,348.475,24,Saint Paul,Minnesota,2
25107,55236,2013-01-31,9,0.000,27,Saint Paul,Minnesota,2
25108,55238,2013-01-31,9,42.000,29,Saint Paul,Minnesota,2
25109,55241,2013-01-31,9,24.986,32,Saint Paul,Minnesota,2

In [58]:
# 도시별 groupby and 합계

City
Albany           1.119409e+05
Annapolis        2.255278e+05
Asheville        6.644511e+04
Atlanta          3.845901e+05
Bloomington      1.315413e+05
Boston           1.138053e+05
Charlotte        1.454050e+05
Columbus         1.872153e+05
Harrisburg       1.421269e+05
Indianapolis     1.488044e+05
LA               1.009753e+05
Minneapolis      2.852598e+05
Nashville        1.182960e+05
Oklahoma City    3.102069e+05
Olympia          1.205583e+05
Phoenix          4.475075e+05
Raleigh          1.095650e+06
Richmond         2.188491e+05
Sacramento       0.000000e+00
Saint Paul       4.989027e+06
Wilmington       0.000000e+00
Name: Qty, dtype: float64

In [ ]:
# 도시의 store 당 평균 판매량
stores['City'].value_counts()

### **(4) pivot**
* pivot : 결합은 아니지만, 집계 후 데이터프레임 구조를 변형해서 조회하는데 종종 사용 됩니다.

* 단계
    * 1) groupby
    * 2) pivot

In [59]:
# 1) 매장1의 일별 카테고리별 판매량을 집계

temp = pd.merge(sales1, products)
temp2 = temp.groupby(['Date', 'Category'], as_index = False)['Qty'].sum()
temp2

           Date         Category       Qty
0    2013-01-01            Drink     0.000
1    2013-01-01             Food     0.000
2    2013-01-01          Grocery     0.000
3    2013-01-01  Household Goods     0.000
4    2013-01-02            Drink  1158.000
..          ...              ...       ...
119  2013-01-30  Household Goods   932.000
120  2013-01-31            Drink   971.000
121  2013-01-31             Food   751.766
122  2013-01-31          Grocery  1907.797
123  2013-01-31  Household Goods   711.000

[124 rows x 3 columns]

In [61]:
# 2) pivot
temp3 = temp2.pivot( index='Category',columns= 'Date' ,values='Qty')
temp3

Date,2013-01-01,2013-01-02,2013-01-03,2013-01-04,2013-01-05,2013-01-06,2013-01-07,2013-01-08,2013-01-09,2013-01-10,...,2013-01-22,2013-01-23,2013-01-24,2013-01-25,2013-01-26,2013-01-27,2013-01-28,2013-01-29,2013-01-30,2013-01-31
Category,,,,,,,,,,,,,,,,,,,,,
Drink,0.0,1158.000,985.000000,1055.000000,1319.000,407.000,1267.000,1115.000,1290.00000,914.000,...,1114.000,1152.000,924.000,1213.000,1132.000,417.000,830.000,999.000,1140.000,971.000
Food,0.0,1227.652,913.699000,790.366000,901.057,416.912,852.676,829.851,967.58200,775.515,...,780.201,1025.047,791.388,836.856,880.019,416.783,821.064,668.154,900.092,751.766
Grocery,0.0,3305.130,2613.685001,2711.079001,2746.782,926.282,2689.720,2356.277,3023.57298,1933.235,...,2242.216,2824.296,2221.805,2393.208,2257.907,1162.207,2208.364,2001.047,2662.485,1907.797
Household Goods,0.0,1070.000,836.000000,834.000000,821.000,257.000,830.000,830.000,917.00000,687.000,...,786.000,769.000,622.000,701.000,551.000,247.000,625.000,617.000,932.000,711.000

In [ ]:
# sns.heatmap으로 시각화 할 수도 있습니다!

plt.figure(figsize = (20, 6))
sns.heatmap(temp3)
plt.show()

## **4.복습문제**

In [ ]:
# 라이브러리 불러오기
import pandas as pd

In [74]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")
print(sales.columns)
print(products.columns)
print(stores.columns)

Index(['Order_ID', 'Date', 'Store_ID', 'Qty', 'Product_ID'], dtype='object')
Index(['Product_ID', 'Product_Code', 'SubCategory', 'Category', 'LeadTime',
       'Price'],
      dtype='object')
Index(['Store_ID', 'City', 'State', 'Store_Type'], dtype='object')

1) sales에 금액(Amt) 변수를 추가하시오.
* Amt = Qty * Price

In [86]:
# 병합 먼저 product id로

,Order_ID,Date,Store_ID,Qty,Product_ID,Amt,Product_Code,SubCategory,Category,LeadTime,Price
0,3,2013-01-01,1,0.000,3,0.000,DB001,Beverage,Drink,2,8
1,36,2013-01-01,10,0.000,3,0.000,DB001,Beverage,Drink,2,8
2,69,2013-01-01,11,0.000,3,0.000,DB001,Beverage,Drink,2,8
3,102,2013-01-01,12,0.000,3,0.000,DB001,Beverage,Drink,2,8
4,135,2013-01-01,13,0.000,3,0.000,DB001,Beverage,Drink,2,8
...,...,...,...,...,...,...,...,...,...,...,...
25105,55109,2013-01-31,54,3.000,32,102.000,GS001,Seafood,Grocery,3,34
25106,55142,2013-01-31,6,20.089,32,683.026,GS001,Seafood,Grocery,3,34
25107,55175,2013-01-31,7,43.647,32,1483.998,GS001,Seafood,Grocery,3,34
25108,55208,2013-01-31,8,42.621,32,1449.114,GS001,Seafood,Grocery,3,34
25109,55241,2013-01-31,9,24.986,32,849.524,GS001,Seafood,Grocery,3,34

2) City별 매출액

In [87]:
# store_id 로 sales와 stores를 병합 시키고, city 별 stores의 합를 구하면 됨
# 병합

,Order_ID,Date,Store_ID,Qty,Product_ID,Amt,Product_Code,SubCategory,Category,LeadTime,Price,City,State,Store_Type
0,3,2013-01-01,1,0.0,3,0.0,DB001,Beverage,Drink,2,8,Saint Paul,Minnesota,4
1,1785,2013-01-02,1,1091.0,3,8728.0,DB001,Beverage,Drink,2,8,Saint Paul,Minnesota,4
2,3567,2013-01-03,1,919.0,3,7352.0,DB001,Beverage,Drink,2,8,Saint Paul,Minnesota,4
3,5349,2013-01-04,1,953.0,3,7624.0,DB001,Beverage,Drink,2,8,Saint Paul,Minnesota,4
4,7131,2013-01-05,1,1160.0,3,9280.0,DB001,Beverage,Drink,2,8,Saint Paul,Minnesota,4

In [89]:
# groupby

             City           Amt
0          Albany  9.618918e+05
1       Annapolis  1.926923e+06
2       Asheville  5.699986e+05
3         Atlanta  3.374833e+06
4     Bloomington  1.154652e+06
5          Boston  9.879414e+05
6       Charlotte  1.229219e+06
7        Columbus  1.650586e+06
8      Harrisburg  1.345873e+06
9    Indianapolis  1.256235e+06
10             LA  8.744844e+05
11    Minneapolis  2.545655e+06
12      Nashville  1.019337e+06
13  Oklahoma City  2.745415e+06
14        Olympia  1.053570e+06
15        Phoenix  4.192750e+06
16        Raleigh  9.539228e+06
17       Richmond  1.866015e+06
18     Sacramento  0.000000e+00
19     Saint Paul  4.479337e+07
20     Wilmington  0.000000e+00

3) City별 카테고리별 매출액

          City         Category           Amt
0       Albany            Drink  2.367080e+05
1       Albany             Food  6.998561e+04
2       Albany          Grocery  3.676481e+05
3       Albany  Household Goods  2.875500e+05
4    Annapolis            Drink  3.507200e+05
..         ...              ...           ...
79  Saint Paul  Household Goods  1.081224e+07
80  Wilmington            Drink  0.000000e+00
81  Wilmington             Food  0.000000e+00
82  Wilmington          Grocery  0.000000e+00
83  Wilmington  Household Goods  0.000000e+00

[84 rows x 3 columns]

4) 매출액이 가장 높은 주(state) top 3

In [95]:
# 주별 매출액

            State           Amt
6       Minnesota  4.733903e+07
8  North Carolina  1.133845e+07
0         Arizona  4.192750e+06

추가 문제

* 2013년 1월 세째 주 각 도시별 subCategory별 금액 비교
    1. 2013년 1월 세째 주
        * sales['Date']를 날짜 타입으로 변환
        * week 추가
        * sales에서 week가 3인 데이터 뽑기
    2. 각 도시별 subCategory별
        * 1의 결과에서...
        * stores와 inner merge
        * products와 inner merge
    3. 도시별 subCategory별 금액
        * Qty * Price로 Amt 추가
        * groupby
    4. 좀더 보기 좋게! pivot + heatmap
        * pivot
        * heatmap

5. 도시의 가게당 평균 매출액을 구하고 새로운 컬럼 추가시키기

In [ ]:
# 도시당 총 매출액 df를 만든다
# 도시당 가게수 df를 만든다.
# 두 df를 merge하고 가게당 매출액을 구한다. 이를 원본 df에 도시를 기준으로 merge 한다.